import random                                                         #імпортуємо модуль випадкових чисел
guess_num = 0                                                         #кількість спроб = 0
number = random.randint(1, 100)                                       #отримуємо випадкове число в діапазоні від от 1 до 100
print ('Спробуйте вгадати число від 1 до 100. У вас буде 6 спроб!')   #виводимо текст з умовою задачі
while guess_num < 6:                                                  #кількість введених спроб < 6
    guess = int(input('Введіть число: '))                             #отримуємо число
    guess_num += 1                                                    #збільшуєм кількість числа спроб +1
    if guess < number:                                                #введене число < загаданого:
        print ('Ваше число менше загаданого.')                        #виводимо на екран текст з інструкцією
    if guess > number:                                                #введене число > загаданого:
        print ('Ваше число більше загаданого.')                       #виводимо на екран текст з інструкцією
    if guess == number:                                               #введене число = загаданого:
        break                                                         #цикл зупиняється
if guess == number:
    print ('Вірно! Ви використали {0} спроб!'.format(guess_num))
else:
    print ('Нажаль не вірно! Загадане число {0}'.format(number))
